#+TITLE: Arch Linux Dotfiles
#+AUTHOR: James
#+STARTUP: overview

Minimal Arch Linux dotfiles managed with org-mode and GNU Stow.

** 3. Stow packages
#+begin_src sh
# Deploy all packages
./scripts/stow-pkg.sh sway waybar mako fuzzel foot yazi qutebrowser swaylock swayidle zsh matugen

# Or deploy specific packages
./scripts/stow-pkg.sh sway waybar mako

# Make scripts executable
chmod +x ~/dotfile/packages/zsh/.local/bin/select-wm.sh
chmod +x ~/dotfile/packages/swayidle/.local/bin/start-swayidle.sh
chmod +x ~/dotfile/packages/matugen/.local/bin/select-wallpaper.sh
chmod +x ~/dotfile/packages/sway/.local/bin/screenshot.sh
#+end_src

#+RESULTS:
| Stowing: | sway | waybar | mako | fuzzel | foot | yazi | qutebrowser | swaylock | swayidle | zsh | matugen |
| Stowing: | sway | waybar | mako |        |      |      |             |          |          |     |         |

